<
   ir_version: 10,
   opset_import: ["" : 17],
   producer_name: "pytorch",
   producer_version: "2.3.0"
>
main_graph (float[input_1_dynamic_axes_1,1,28,28] input_1, float[6,1,5,5] classifier_conv1_weight, float[6] classifier_conv1_bias, float[16,6,5,5] classifier_conv2_weight, float[16] classifier_conv2_bias, float[120,256] classifier_fc1_weight, float[120] classifier_fc1_bias, float[84,120] classifier_fc2_weight, float[84] classifier_fc2_bias, float[10,84] classifier_fc3_weight, float[10] classifier_fc3_bias) => (float[gemm_1_dynamic_axes_1,10] gemm_1) 
   <float[6,1,5,5] classifier_conv1_weight =  {-0_00503576,0_00187445,0_00831705,-0_011907,-0_00217289,-0_0129103,0_00757551,0_00752578,0_013801,-0_01455,0_0203308,-0_00720515,-0_000491372,-0_00331762,0_0087865,0_00600544,-0_00275909,0_00307528,0_00946032,-0_00562756,-0_0135882,0_00391647,-0_0139116,0_0221461,0_00634159,-0_0161036,0_0181782,0_00975052,0_00018374,0_00368707,0_0190099,0_020902,0_00143424,0_0151341,-0_0125405,0_00310384,0_00771321,0_0130782,0_010451,7_3613e-06,0_0110515,-0_0220256,-0_00888421,0_0138737,-0_00147357,-0_00719674,0_0112622,0_010243,0_0138516,-0_011809,-0_0013202,0_0344934,0_0056455,0_00810445,-0_000651807,-0_00363467,-0_0199913,-0_00197293,-0_000229549,-0_00465476,0_0175828,-0_011693,-0_00522229,-0_00468727,5_29541e-05,0_00161044,0_00725749,-0_0113708,-0_00748828,-0_00345262,0_00917275,-0_00324549,-0_00106955,0_00876788,0_00823525,0_00747872,0_00866331,0_00852502,-0_00531866,-0_0216476,-0_0176375,0_0197179,0_0125312,-0_00222955,0_0141935,0_00473482,0_000486016,-0_0122322,-0_000898886,0_0148529,0_0105592,-0_00488301,-0_00311247,0_00663911,0_00315893,0_0137626,0_0188274,-0_0136565,0_00170504,-0_00313809,-0_00719838,0_00997692,-0_00465146,0_0171303,0_00363246,0_00900964,0_00783905,0_00947705,5_59438e-05,-0_0215819,-0_0326675,-0_00728377,0_00926313,0_0143397,0_0179722,0_00291344,-0_00839188,0_0055322,-0_010986,0_00445098,0_0114024,-0_00931434,-0_0121405,0_0105349,-0_0058252,0_0145393,0_00922164,0_0133077,-0_00230923,-0_0155491,0_0123833,-0_000295984,-0_00209015,0_000712776,0_0245262,-0_00361522,-0_00696474,-0_000763132,0_0017071,0_0134083,0_0156821,0_0016325,-0_0133695,0_00673013,-0_0166175,0_00262629,0_00702535,-0_0104698,0_00344251,-0_00578165}, float[6] classifier_conv1_bias =  {-0_00884659,0_0079806,-0_00428949,-0_00630734,-0_00762466,-0_0026098}, float[16,6,5,5] classifier_conv2_weight =  {-2_21257e-05,-0_0110407,-0_00934064,0_00432859,0_0125045,-0_00154385,-0_00180728,-0_0164005,0_00058985,-0_00706053,-0_0222803,0_0102808,0_0172244,0_00780403,-0_00937326,-0_00204148,0_00383559,4_53324e-05,0_00775662,-0_00716621,-0_00444277,-0_0177462,0_00219141,-0_0148175,0_0125026,-0_000802923,0_0139332,-0_011437,0_00148216,-0_00640281,-0_00496009,0_0120353,-0_00332604,0_0130883,0_0041589,-0_0158474,0_0063216,0_00625211,0_0070328,-0_00149652,0_00648303,-0_00929715,-0_0148399,-0_00704144,-0_00271209,-0_029663,-0_000612023,0_00231334,0_0112918,0_0186931,-0_0127144,-0_00159357,0_00571747,0_00527524,0_00306068,-0_018584,0_0151005,0_0219771,-0_00598533,0_0231169,-0_00142637,-0_0218021,-0_00532792,0_0150648,0_00414493,0_0213707,-0_00928623,-0_000231733,-0_0144801,0_00158386,-0_0043734,-0_00151621,-0_00223196,0_0126945,-0_00566948,-0_0014256,0_000301503,-0_00303973,0_0130576,-0_000254137,-0_0103562,-0_0125042,0_0115095,-0_00405659,-0_00176415,-0_00122306,0_00524845,0_0065011,-0_0116818,0_00909542,-0_00191046,0_00259982,0_011359,-0_0150322,0_0190067,-0_0139664,-0_0204876,0_0067844,0_0133666,-0_00843854,-0_0106929,-0_00565586,0_00262002,-0_0110556,-0_0146738,0_00446537,-0_00882576,-0_00129269,0_00650229,0_0133483,0_0011975,-0_00784879,0_00454228,-0_00740098,-0_0180571,-0_0101639,-0_00594024,-0_00461859,0_00995514,-0_000285502,-0_00426618,-0_00308326,-0_000774987,-0_0203451,0_00507257,-0_00183466,-0_00217767,-0_00419389,-0_00498366,-0_00570637,-0_00240949,0_0135915,0_00624359,0_000885716,-0_000139637,0_0125624,0_00561171,0_000587067,0_0031794,0_0164744,0_00847098,-0_0267847,-0_0102658,-0_0139576,-0_0127589,-0_00189001,-0_00124162,0_00550792,-0_00492095,0_00161187,0_023843,-0_00394932,-0_0222618,-0_0226262,-0_0146584,-0_0100378,-0_010206,-0_00707527,-0_01334,0_00439963,-0_0020558,0_000524877,0_00860969,0_00217958,-0_00259225,-0_00303285,0_0112999,0_00667358,-0_00552272,-0_00181249,0_00295832,0_0154292,-0_00699229,0_00170484,-0_00305142,-0_0137218,-0_000392714,0_0137191,0_00103732,-0_0101453,0_00659515,-0_00294416,-0_018391,-0_00572528,0_00549052,-0_0042534,0_0172229,0_00652689,0_00364871,-0_00291258,0_00176958,0_00407042,0_00133741,0_0061145,-0_0103981,0_007969,-0_00408994,-0_0149989,-0_00598204,0_00267625,0_00705932,-0_00689776,-0_00767722,0_0133723,0_0218347,0_0115662,0_00435632,0_00685533,-0_0129949,0_00773494,-0_00471692,-0_00395122,-0_0102951,0_0125724,0_00748203,-3_31577e-05,-0_0139238,-0_00360326,-0_00882087,-0_00885643,0_00194758,-0_0162901,0_00286269,-0_0113893,-0_00200929,0_0037018,-0_00253201,0_00592445,0_00550124,-0_00500809,0_0160845,-0_000178632,-0_00523636,0_00283759,-0_00316087,-0_000668281,-0_00906796,0_015246,0_0167391,-0_000141247,-0_00477596,-0_00838855,0_00707136,0_00793243,0_0218372,0_00605337,0_0076513,0_00357978,-0_00958784,0_00333769,0_00665727,0_00237771,0_0204644,-0_00129319,-0_00393894,0_0050546,0_0258089,0_0157772,0_00283223,0_0117969,-0_00137593,-9_37896e-07,-0_0105189,-0_00402384,-0_00338669,0_00943914,-0_0058179,-0_000874727,0_0123611,0_000409205,0_000755305,-0_00721987,-0_00486575,-0_00768181,0_00381876,0_000928943,-0_00939993,-0_00667377,-0_00198998,-0_0108555,-0_000385655,-0_0149098,-0_00887191,-0_00651094,0_00777947,0_00734498,0_00303754,0_00957694,0_00300342,0_00661646,0_000219011,-0_00541966,0_000347461,0_00160513,0_00343015,-0_00520191,0_00860451,-0_0012579,-0_00495791,-0_00384382,0_00609977,0_00572016,-0_0143904,-0_00540418,0_011203,-0_00187263,0_0113019,0_00576482,0_00128091,0_00172445,-0_00882595,-0_00634996,0_00621808,-0_0110234,0_0210813,-0_0142639,0_0140367,0_00911059,-0_00328795,0_0090884,-0_0126624,0_0135887,-0_0196964,0_0036855,-0_00543614,-0_00120258,-0_0113163,-0_000256839,-0_00826648,-0_0151683,0_00720406,-0_000704137,-0_00572576,-0_00309424,0_00555482,-0_0143607,0_00764094,0_00197422,-0_0202184,0_01231,0_00839379,-0_00392754,0_00238477,-0_0031002,-0_00524473,0_0155605,0_0108871,-0_00783106,0_00552377,0_00367377,-0_00609424,-0_00116603,0_00591302,0_00519954,-0_0107451,-0_00389062,-0_0127987,-0_00777951,-0_00945634,-0_00894757,0_00798107,0_00906791,0_000268076,0_00371965,-0_0160274,-0_0184743,-0_0123964,0_00573899,0_0032412,0_00620676,-0_0110633,0_00512446,0_011237,0_0141884,0_0124898,-0_00947256,0_00345384,0_0124114,-0_00706948,-0_0213546,0_00559364,0_0012021,0_0211842,-0_0211373,-0_0100091,0_00558766,0_0186501,0_00588386,0_007959,0_0026105,0_00577174,-0_00274133,0_00244241,-0_00681945,-0_00538899,-0_0113312,0_000479134,0_00157373,-4_54398e-05,0_00171684,-0_000348977,-0_00607999,0_0079149,0_00875581,0_0101338,0_00835022,-0_0127833,-0_0134034,0_00642863,0_0046574,0_00912241,0_00172091,-0_0154009,0_00220141,-1_75823e-05,-0_00345676,0_00605349,-0_00672991,0_00104282,-0_00316099,0_0128938,0_00883404,0_00124121,0_00191805,0_00432344,0_00166464,0_0222888,-0_0134161,0_00787621,0_0174591,0_01968,-0_00700333,-0_0144053,-0_0106496,0_00422067,0_0180539,-0_0170028,-0_00978139,0_00105087,0_00282211,-0_00161667,-0_0178051,0_00730356,0_00169035,-0_0148941,-0_00271149,0_00120065,-0_00722864,0_000516141,0_00128146,-0_00688589,-0_00517082,0_00681369,-0_00604827,0_0230817,-0_0143041,0_000590461,0_00615026,-0_0161514,-0_00706266,-0_00876447,0_00230431,6_76439e-05,0_00276034,-0_00633238,0_000505587,0_0117287,0_011225,-0_00880103,0_00121162,0_00264671,-0_00442545,-0_0101335,-0_00416609,0_0192298,-0_00504204,-0_000208389,0_00649799,-0_0152548,0_011438,-0_00775878,-0_0101227,-0_0216747,-0_022564,0_0111231,0_00314436,-0_00156899,-0_00787301,-0_0124736,0_00606847,-0_00171348,-0_00485672,-0_00951184,0_016886,0_00525308,0_00370443,0_00486962,0_00700738,-0_00575589,0_0102859,0_0168898,0_00439139,0_0198037,0_0109621,-0_00613035,-0_0027147,0_0124408,0_00177306,0_00767815,0_0124493,-0_0102248,0_0188884,-0_000318532,-0_00210404,-0_00288236,-0_00567549,-0_000485841,-0_00135935,-0_00135723,0_000606015,0_0188195,0_00118521,-6_17508e-05,0_00631338,-0_0144144,-0_00672249,0_0137919,0_00297287,-0_00160943,0_0227848,-0_0110534,0_0295688,0_00151223,-0_00973964,0_0121362,0_00560985,-0_0129399,0_00296185,-0_00424023,0_00936325,-0_00496822,-0_0210806,0_00122113,-0_0208042,0_00299061,0_00120722,-0_000832545,0_00739346,0_000541359,0_00626996,0_000652753,-0_0190426,0_0130544,0_00956458,-0_00368415,-0_014667,0_0055018,0_00113392,-0_000989208,-0_0168647,-0_0119602,-0_0116298,-0_0195443,0_00189456,-0_0130012,-0_0152937,0_00190047,0_00700045,0_0045191,0_00728365,0_015233,0_0136586,-0_00795993,0_0123226,0_00368803,0_00504415,0_0122362,-0_00972095,0_000508592,0_00574866,-0_0026649,-0_00920684,7_35578e-05,-0_00968468,0_00039419,0_00614958,-0_00672843,0_00318003,-0_00278719,0_0016474,-0_0136622,0_00765468,0_0179089,-0_00155071,0_00082646,-0_0020073,0_00756226,-0_00720092,0_014336,-0_00811101,0_00401347,0_020061,0_00189519,-0_00304318,0_0111446,-0_00821941,0_0260956,0_00129318,0_000895334,-0_0117624,0_00980423,0_010767,0_0128243,-0_012543,0_0122658,-0_00917116,-0_00611916,-0_00618198,0_00199609,-0_00348063,0_00345638,0_0158277,-0_00191481,-0_000135235,0_0126005,-0_00674767,-0_001402,0_010997,-0_000965513,0_0216314,0_0033885,0_00753925,0_00124934,0_00366769,-0_00855928,-0_00639185,0_00140413,-0_00475854,-0_00499611,-0_0151145,0_00632163,0_00355427,-0_00301885,-0_00465443,-0_0172369,0_00294035,0_00399207,-0_00204527,-0_00365018,-0_00995569,0_00127976,-0_00885694,-0_0186715,-0_00254198,0_0243035,-0_00486419,0_00976684,0_00392566,0_0107745,-0_000610501,-0_00189801,-0_010468,0_0249579,0_0147056,0_0118827,0_00540567,0_00787502,0_00522016,0_00745484,-0_0103048,-0_00294137,0_000375879,0_0102091,-0_00779543,-0_0119101,0_00273582,-0_00575092,-0_00917506,-0_00286779,0_00877938,0_0130645,-0_0316526,0_000928864,0_0195996,0_000409074,-0_00562523,-0_00240037,-0_00867762,-0_00881122,0_00747963,0_00800484,0_0164581,0_00118784,0_00251397,0_0124399,-0_0011985,0_0168355,-0_0071097,0_0130273,0_00554583,-0_000139342,0_00446603,-0_0110286,0_00181431,0_00466102,-0_00133844,0_00517942,0_0183002,0_00914138,0_00559709,0_00416168,-0_0079788,0_0122636,0_00238702,0_00899713,0_00752603,-0_0176886,0_000317521,0_00195007,-0_00786234,0_0135015,0_00228691,-0_0105156,0_00245994,0_00619582,-0_00674618,0_0178333,-0_0107469,0_00666104,0_00927592,0_0141038,-0_000614483,-0_00717568,0_0145457,0_00267699,-0_00313884,0_000230829,-0_0137789,0_012568,-0_000984527,0_00283859,-0_000281476,-0_0011105,0_0138874,-0_00617378,-0_00774444,0_0185593,0_00712325,0_00422361,-0_00793251,0_00934859,-0_00562675,-0_00566456,-0_000952562,-0_000335694,-0_00882586,-0_0069656,0_00736789,0_00543175,0_00573835,0_00934945,0_0070201,0_00538502,-0_0159737,-0_0181206,-0_00459743,0_00179559,0_0153204,0_000655177,-0_0130698,-0_00360198,0_00820911,-0_00201594,0_00316609,-0_00630371,-0_00684808,0_00230125,-0_0054331,-0_00510821,0_00613887,-0_0155645,0_0109453,-0_0010906,-0_00157196,-0_0206287,-0_0136654,-0_0014187,0_000213119,0_00665045,-0_00965648,-0_0168703,-0_00535085,0_00644893,-0_00116788,-0_00477016,-0_012914,-0_01138,-0_00891767,-0_00187996,-0_00303138,-0_0158513,-0_00599042,0_0204042,0_00847496,-0_00694666,0_0219792,-0_0108331,0_0106485,0_00675841,-0_0041614,-0_00387498,0_00623462,0_0108813,3_76278e-05,0_00835996,0_016627,-0_0102095,0_0101378,-0_00496402,0_00179642,-0_0230392,-0_00506989,-0_00269422,0_00654482,0_0138956,0_00833825,0_0132626,-0_0143638,0_00152057,-0_00260033,-0_00385648,0_0206914,-0_00959134,-0_00973823,0_00185074,-0_0114503,0_00244715,0_00841175,-0_00729524,0_00228037,-0_0169283,0_0167919,0_00816573,0_00200218,0_00319041,-0_00233578,0_0203111,0_00443466,0_000713479,-0_0134509,-0_00782595,0_0132936,-0_00124108,-0_00179412,0_00413403,0_00407733,-0_0141637,0_00462668,0_00549489,0_0139897,0_0123877,-0_00552985,-0_00907596,-0_0135234,-0_00371018,-0_00798612,0_00832608,0_0137794,0_0126176,-0_00414791,0_00570904,-0_00321646,0_00193986,-0_00336646,0_0145995,0_000379952,0_00414688,0_00822333,0_00979329,-0_011969,0_0158878,-0_0155853,-0_00863264,0_000104567,-0_01733,-0_0221805,-0_0128084,-0_0053085,-0_0118079,0_00466382,0_00512861,-0_0159011,-0_0058726,0_00250541,0_0134605,-0_00869596,-0_0111153,-0_0110035,-0_00780042,0_00345368,-0_00270332,0_00142499,-0_00518705,0_000622722,-0_0159945,-0_00926046,-0_00236687,-0_00149876,0_00922132,-0_00528755,0_00720376,0_010152,0_00462823,0_00490067,-0_000859307,-0_000481855,0_00202511,0_00282475,0_00150913,-0_0191539,-0_0125671,0_00709121,-0_0190532,0_00984642,0_0160826,0_00709563,0_00859299,-0_00814134,0_00722387,0_0122021,-0_0218743,0_00702256,-0_016105,0_0165875,0_00402569,0_00731783,0_00864899,-0_00642423,0_000746461,-0_0151893,6_18878e-05,0_0106156,-0_0064085,-0_0138741,-0_0038242,-0_0173048,-0_00540521,0_0272375,0_0155867,-0_0123791,0_00936956,-0_0189432,-0_00797628,-0_0115473,0_0118767,0_00627969,-0_000357026,-0_00230947,0_0082747,-0_00505755,0_0125666,0_00169277,-0_00667882,-0_012589,0_000879554,-0_012404,0_0253068,-0_00500032,-0_0194805,-0_000327079,0_0091521,0_00926773,-0_00286358,-0_00846919,0_0151157,0_00648795,0_00238593,0_00845703,-0_00189285,0_0205689,0_0168783,-0_0132839,-0_00318718,0_012113,0_012688,-0_0154641,0_00541949,-0_0136724,-0_00977722,-0_00295209,0_0128582,0_00607901,0_00765443,0_015344,-0_00414273,0_00203904,-0_0201221,-0_00499657,-0_00778736,-0_0012795,0_011285,-0_00810142,0_00193559,-0_0139982,-0_0100406,0_00547538,0_00353104,0_00192175,0_00172377,0_00171711,0_00606127,-0_00694775,0_00759944,-0_00462221,0_0224416,-0_00475577,0_000314957,-0_0138794,0_0279772,0_0059526,0_00676976,0_0145029,0_00746304,-0_0184524,0_00858111,-0_0102462,-0_00158742,0_00377193,0_00225484,-0_00748031,0_00456407,0_00204799,-0_0111645,0_00322785,-0_00121966,0_00674909,0_00935761,-0_0128445,0_00443326,-0_000504502,-0_00308653,0_0161349,0_00253681,0_000523102,0_00516888,0_00464186,0_014034,-0_00873556,0_00687582,-0_00310763,0_013897,-0_011144,0_00375401,-0_00422167,0_00146898,-0_0160567,0_00456154,-0_00601065,0_00834444,0_00934615,-0_00629961,-0_0042033,0_00741302,-0_0163062,0_00225282,-0_00363952,0_00533082,0_0139857,0_0064755,-0_00893839,0_00653041,0_0165704,-0_0254014,0_00274734,0_00746567,0_00331953,-0_00807302,0_0228249,-0_0103663,-0_0101644,-0_00690608,0_007356,0_0137175,-0_0029009,-0_00427792,0_0117735,-0_00682879,0_0042598,-0_0013153,-0_0055541,-0_00218426,-0_00180388,0_0122131,0_00600884,-0_0183583,-0_0231275,-0_00664743,0_0238147,0_00522981,-0_00309704,0_00769018,0_00641988,-0_00281935,-0_00675306,-0_00435526,-0_00177167,0_0160186,-0_00284811,-0_00146389,-0_00568533,0_0173225,-0_00780674,-0_0078533,0_00698559,-0_00356498,-0_00343508,0_00485114,0_00640093,0_0150643,0_000898071,0_0153103,0_000337861,0_00759982,-0_0149577,-0_0192799,0_0107111,0_00467062,-0_0197207,-0_0158483,0_0136386,-0_00882371,-0_005604,0_0302939,0_00472107,-0_0250559,0_00478389,-0_00477724,0_00247413,0_00190316,0_00591178,-0_00696333,0_00696294,-0_00386254,0_0124099,-0_00282907,0_00911551,-0_0030514,0_0087506,-0_00901292,-0_0139129,0_00272883,0_000556956,0_00838805,-0_00501896,0_00655284,-0_00927934,0_00042139,-0_0130896,-0_00481378,0_00153483,-0_00373531,-0_000457885,-0_00308389,-0_00583109,0_0031423,0_0127965,-0_00817545,0_00409337,0_00454121,-0_00564413,0_00385148,0_0238963,0_00182641,-0_0169226,-0_00198722,-0_0168835,-0_0128924,-0_0121773,-0_00195097,-0_00245446,-0_00438941,-0_00852975,0_00141316,-0_00497559,0_00690852,0_0106089,-0_00313591,0_0108306,-0_0149218,-0_00546058,0_00337278,-0_00292219,-0_0155187,0_0115962,0_00753911,-0_00452744,0_0164689,0_0149963,0_01737,0_0143166,0_00276233,0_00031936,-0_000627951,-0_00434735,4_99177e-05,0_00402609,-0_00330193,-0_0147813,0_00898227,0_000926704,-0_0119334,0_0123129,-0_00419523,0_00027777,0_00830937,0_0145178,-0_0224575,-0_0108283,-0_0107544,-0_00377731,0_00422233,0_00147359,0_00810837,-0_00914131,0_00278912,0_00560093,0_0101115,0_000941571,-0_00631942,-0_00474986,0_000462119,0_00751324,-0_00781075,0_00593866,-0_00221922,-0_0122804,-0_0155274,-0_00544589,-0_0180734,-0_00298165,-0_0175895,-0_00264295,-0_00830602,0_00118571,-0_00522763,-0_00763838,-0_0128555,-0_0117456,-0_00399888,0_00618537,0_00352502,-0_00619572,-0_000770783,9_77474e-05,-0_00455816,-0_00288772,0_00676332,-0_00356286,-0_0108457,-0_000905142,0_00259123,0_00943084,-0_00403316,0_0193171,0_0108236,8_14494e-05,0_00815134,-0_00903252,-0_00855505,-0_0121645,0_00490855,0_00684287,0_00094436,0_00767662,-0_0146998,0_00483877,0_00505975,-0_0120733,0_00296575,0_00173726,-0_00522153,0_0088131,-0_00314759,-0_004217,-0_00957319,-0_013203,0_00443157,0_00672941,-0_00904234,-0_0144303,0_0223683,0_00883574,-0_0157704,-0_0066494,-0_0200485,-0_00538161,-0_000565759,0_0135458,0_00852912,-0_0053337,-0_010303,0_00288413,-0_00384195,-0_00451165,-0_0257692,-0_0117909,0_020866,0_0184639,0_00815116,0_010195,0_0127845,0_0103805,-0_000148944,0_0208623,-0_0132495,0_00160653,-0_0129308,-0_0126127,0_0119253,0_0173192,-0_0067997,-0_00823331,0_00177641,0_0198858,0_00270547,-0_00438509,0_0118315,0_00964074,-0_0177576,-0_00455769,0_00726297,0_00201388,-0_011019,0_0208057,-0_023573,0_0171323,-0_0229866,0_000201149,0_00540946,-0_000225331,-0_00265653,9_70594e-05,-3_66619e-05,0_0104844,0_00592464,-0_0216561,-0_00607886,-0_0117047,-0_0109826,0_00704865,-0_0124104,0_000774726,0_00807768,0_00688789,-0_015127,-0_00795733,0_00787881,0_00294045,-0_00515189,-0_000307372,-0_00659926,0_0137923,0_00521172,-0_00169359,-0_00507896,-0_000615637,0_0174398,0_019092,-0_0103105,0_00611027,-0_00733343,-0_00538379,0_00185611,0_0044679,-0_00292752,-0_00306557,-0_0117105,-0_0039401,-0_00506142,0_0092268,0_0154242,-0_00533736,-0_00799902,0_0159667,-0_00195433,-0_0105884,0_023839,0_0051684,-0_00872144,-0_0101043,-0_00450231,0_00500942,0_00399037,0_0060749,0_00122986,0_0228847,0_0183494,0_0253871,0_00165848,0_0169229,-0_00924144,-0_00360276,-0_0090894,-0_00592552,-0_00984701,0_010027,0_00294001,-0_014439,-0_0079024,0_00989634,0_00942369,0_00142063,-0_00455615,-0_00904157,0_0043744,-0_00782993,0_0118358,0_00697394,-0_00495902,-0_0044317,-0_0107948,0_00957721,-0_000239654,0_0166324,-0_00279916,0_0145351,0_00574247,0_00423416,0_0138248,-0_00247394,-0_00193265,0_00408834,-0_00708588,0_00970798,-0_00709555,-0_0159562,0_0101191,-0_00260861,-0_00277357,-0_00802273,-0_00687116,-0_00935926,-0_0227496,-0_00413153,-0_0183673,0_00618605,-0_0153761,0_00813441,-0_00183834,0_00883843,0_000852366,0_00337599,-0_023103,0_00244851,0_00374316,0_0034838,-0_0104111,-0_00321281,0_0114199,-0_00974937,0_00104942,0_00225358,-0_00278217,0_00282614,0_00328235,0_00463212,-0_00395524,0_00492303,-0_0203895,0_00410332,-0_00496431,0_0072793,0_00806107,-0_00749498,-0_00370205,0_00555409,0_00855713,0_0127156,-0_0144347,-0_021906,-0_0141925,-0_016501,0_00726228,0_00164298,-0_00743788,0_0152834,0_0028267,-0_0125432,-0_00668292,0_00648526,0_00349935,-0_00566218,-0_0142816,0_00138167,-0_00475703,-0_0059855,-0_00655789,-0_00192954,-0_0151983,-0_00231702,0_0123945,-0_00303049,-0_00952269,-0_00863657,-0_00162755,-0_00477461,0_0112202,0_0145015,0_00702548,0_00623048,0_00473783,0_010445,-0_00152003,0_00233522,0_0132865,-0_00320345,0_00595944,-0_00182334,-0_0117718,-0_000692723,0_00914778,0_00255841,0_00235965,-0_0122321,0_0131247,-0_0152388,-0_0174954,-0_00699196,-0_00928992,-0_00671483,0_00902633,-0_00424803,-0_0104014,0_00366656,0_0109549,-0_00721489,0_0115686,-0_0144084,0_00851077,0_00248124,-0_00350255,-0_0055113,-0_00647608,-0_00533548,-0_00265731,-0_00982064,-0_00883192,0_00563025,0_00966145,-0_00568197,0_0170455,0_00304244,0_0147479,0_00584641,0_00210458,0_0145292,0_00084447,-0_0280375,-0_00482512,0_00549311,-0_00823465,-0_0115253,-0_00578465,-0_012657,0_00335208,-0_0167481,0_01484,-0_00588847,-0_00736976,0_00490584,0_00507346,-0_0132149,0_0129275,-0_00253632,-0_00114957,0_00436305,0_00685598,-0_00552407,-0_00559995,0_00437968,-0_0160455,0_0165481,0_013784,-0_00604965,-0_00752059,0_000763987,0_00379802,0_0017915,0_000382555,-0_0112461,0_00512003,-0_00772443,0_0120597,-0_0165933,0_00149917,-0_00412746,-0_00704046,0_00439876,0_00564749,-0_000722441,0_0205161,0_00762322,0_00736567,0_00366872,-0_0145644,-0_00514341,0_00143552,0_00668321,-0_0142284,0_0104658,-0_0136641,0_0155373,0_00771145,0_00208996,-0_012546,0_00357966,0_00940101,0_000470989,0_00767362,0_000637972,0_00152051,0_00937431,0_00869571,-0_0030756,-0_00696862,0_01005,0_00312162,-0_00528257,3_36161e-05,0_00815552,0_00060881,0_0153676,-0_0179258,0_0123924,-0_0231438,0_0154433,0_00993028,0_00324713,-0_00332962,0_00484532,-0_020536,0_00898869,0_000997413,0_0106895,0_0136856,-0_00419277,-0_0173214,0_00136102,-0_00851873,0_00121044,0_00552046,0_0173017,-0_0134396,-0_00312494,0_000858858,-0_00682251,-0_013787,0_00957249,-0_000649626,0_00478052,0_010062,-0_0165204,-0_0055617,-0_000937993,0_0153742,-0_00946874,0_0072103,0_00254439,0_00197974,-0_0155895,-0_00595087,-0_00151746,-0_0123749,-0_000825235,-0_00446585,-0_0079964,0_0104013,0_00866874,0_0134768,0_00193898,-0_0109942,0_00149531,0_0197031,0_00948991,0_00436406,-0_000391867,0_00987987,-0_0350628,-0_0109717,-0_00245187,-0_0120282,-0_00112002,0_0121883,0_00886588,-0_00686848,0_00601131,-0_00134384,-0_0140208,-0_000711546,-0_00297573,-0_00517619,0_0211173,-0_000955823,-0_0159333,0_00282965,-0_0147225,0_00268046,0_00887861,0_0110162,-0_0105952,-0_00289544,0_00592998,0_00409757,-0_00419337,0_000927639,-0_00752525,0_00558714,0_0106656,-0_013308,-0_014252,-0_00538946,-0_0125928,0_00374661,-0_0171933,-0_00925679,-0_00547917,-0_0043473,-0_0290796,0_00623402,0_0111964,0_0134595,0_0199049,-0_000576097,0_00609467,-0_00638367,-0_00303297,0_00514943,0_00562776,-0_0109974,0_0151129,0_0163989,-0_0115179,0_00835862,-0_00288174,0_00856284,0_00911571,0_000803346,0_0200342,-0_00579908,0_00422,0_0112341,-0_0072091,0_0159008,-0_00112741,0_00281607,0_00288454,-0_00836742,-0_002955,0_0176817,-0_00561272,-0_000592055,-0_00391649,0_002301,-0_00230679,-0_0147793,0_00539732,-0_0061355,0_000583697,-0_00274478,-0_00184852,-0_00951752,0_00106809,-0_0185689,0_0131521,0_00265363,0_0279343,0_00240003,0_00953991,0_00918139,0_00591362,-0_0118764,-0_00074744,0_00259137,-0_00867063,0_0129162,0_0112605,-0_00401204,0_0166855,0_000183228,-0_00768216,-0_00284523,0_00312154,0_0225764,0_0129006,-0_0131779,0_0200497,-0_000731224,-0_00578513,-0_0193413,-0_00948387,-0_00577678,0_0101528,-0_0116312,0_0061709,0_0237514,-0_0217299,-0_0191627,-0_00202855,0_00854903,0_0147187,-0_0143144,-0_00759801,0_0057642,-0_00347334,0_00154768,-0_00193415,0_00562119,-0_0012344,-0_00125262,0_000576616,0_00925982,0_00159587,0_0102105,0_0140292,-0_00806839,-0_0160811,0_00248435,-0_00376283,-0_00108352,-0_000665213,0_00514613,0_00438173,0_00767065,0_00623182,0_0132873,-0_00330107,0_0153493,-0_00482502,0_000283306,-0_0133247,0_00829998,0_00670888,-0_00522365,-0_00557611,-0_00801318,0_00622751,0_00687901,0_0264661,-0_00803168,0_00783729,-0_00866908,-0_0199795,0_00785682,0_0167634,0_00170418,-0_00790487,0_00872831,-0_0220479,-0_0038135,-0_000634815,0_00425049,-0_00639524,-0_0101845,-0_000539505,0_0107166,0_0110741,-0_000989988,0_0203779,0_00356589,-0_017428,0_00198486,0_00958716,0_00508982,0_0163547,-0_000632847,0_00306858,-0_0106203,0_0110913,0_00860047,-0_00711421,-0_0178986,-0_0109864,-0_0100277,0_00161987,-0_00820986,0_00797505,0_00534295,-0_000865388,-0_00226663,0_00565715,-0_00246778,-0_015594,-0_00337559,0_000527879,-0_0150518,-0_0026842,-2_23206e-05,-0_0210079,0_00409742,-0_0215493,0_00152233,-0_0179374,0_0126923,0_00119532,0_00070605,0_00718887,0_00092127,0_000371233,-0_00976571,-0_00528888,0_0103087,-0_00795979,0_0024323,-0_00280039,-0_00908623,-0_0104118,0_01115,0_00919623,0_0156686,0_0206624,-0_00326415,-0_00991117,0_0116856,0_0117929,0_0133872,0_0094506,-0_0127472,0_0233732,0_000966043,-0_0022131,0_00705493,0_00647038,0_000442958,0_00226209,0_00765891,0_00119253,0_00995397,0_00540639,0_0198248,0_00585763,0_00484803,-0_00159894,-5_84829e-05,-0_00848175,0_0151222,0_00673172,-0_0169772,-0_0214054,-0_00654839,0_0107826,0_0126241,-0_0263188,-0_00826597,-0_0137001,0_00588989,-0_00545411,-0_00890116,-0_00157652,-0_00138086,0_00184679,-0_00549998,-0_00820013,-0_00658143,0_0049215,0_00899978,0_0149741,-0_00132979,-0_0172187,-0_00229746,-0_00482918,0_0163665,0_0106463,-0_00340921,-0_00332301,-0_00336682,-0_0185203,-0_00932853,-0_0148565,-0_0201262,-0_0126602,0_00248588,0_0149114,0_0152287,-0_0202262,0_0033393,-0_00704004,0_0161852,-0_00626358,0_00606994,0_00796613,-0_00923902,-0_00624441,-0_00125194,0_00737255,-0_015549,0_00555911,0_0248426,0_00516695,0_00889155,-0_0197105,-0_00768593,-0_00219085,-0_00979448,0_0177198,-0_00784806,-0_0151065,0_000446132,-0_00692678,0_00246979,0_00658556,0_0218298,-0_000627775,-0_00583158,0_0186933,0_00153466,-0_0128619,-0_00401362,0_0144491,0_0161819,-0_00174725,0_0102437,-0_00732192,0_000872814,0_00748633,-0_00153396,0_0215306,-0_00676173,0_00655207,-0_00192906,0_00479744,0_00501826,-0_000657905,-0_00536555,-0_00450591,-0_0102768,-0_00283718,0_00772006,-0_00360974,-0_00873717,0_00433564,-0_00185762,-0_00579778,-0_0131966,-0_00364097,-0_0101359,0_00301633,-0_00628997,-0_000846314,-0_00448326,-0_0190995,-0_000237844,-0_0148971,-0_015934,0_000624688,-0_0159262,0_0154792,0_000676976,0_0152898,-0_00980873,-0_00839065,-3_55297e-05,-0_00990374,3_23439e-05,0_0116807,0_00649868,-0_00791391,0_00867548,-0_00498343,0_000829226,0_0156047,-0_00176878,-0_00830634,0_00346956,-0_000543016,0_00750622,0_00540862,0_0185337,-0_000971275,0_00538852,-0_00901748,-0_0041551,-0_00450372,0_00599371,0_00868723,-0_000254015,0_0219953,-0_00899249,-0_0176604,-0_0185156,0_0107554,-0_00388049,-2_23362e-05,-0_0160388,-0_00725458,-0_00627657,0_00447038,-0_013902,-0_0143378,-0_00431483,0_00736859,0_00554684,0_0044588,-0_000447342,-0_00298532,-0_00690213,0_0106336,-0_0123204,-0_0139755,-0_00124582,-0_0012398,-0_00905759,0_00249135,-0_00353073,-0_00143565,0_00182241,-0_00324259,-0_0127871,0_0150608,0_00142306,-0_0116134,-0_00942036,-0_00817395,-0_00656173,0_0183194,-0_0202676,-0_00332122,0_00166653,-0_00483097,-0_00932652,-0_0126866,0_0111578,0_00443505,0_00577667,-0_00816344,-0_00496386,0_016722,0_0104361,0_0131756,-0_0098007,-0_00207466,-0_0055294,0_00757749,-0_00790593,-0_008614,0_00891489,-0_0157065,-0_00592249,-0_0136784,0_0100367,0_00603895,-0_00432856,0_00821077,-0_0115076,-0_00196913,-0_00495415,-0_012844,-0_0061875,-0_00300303,0_0230919,0_0131026,0_00489792,-0_000841774,0_0163009,-0_0132038,0_00800524,0_00300955,0_0193461,-0_0113562,-0_020928,0_00638114,-0_00368981,-0_0141656,0_00191219,-0_00607226,-0_00896365,0_00937356,-0_00574319,0_00247855,0_0011484,8_66718e-05,0_000718313,0_0214925,-5_95283e-05,0_00498915,0_00166566,-0_0147796,-0_00247799,-7_40044e-05,-0_0204867,-0_0121852,0_0150373,-0_00862183,0_00145186,0_0142444,0_0131413,-0_00102556,-0_0127594,-0_00866243,0_000472218,-0_00326413,0_0322637,-0_000971576,-0_00187879,-0_00561415,0_00407383,0_0154101,-0_0170514,0_00161598,-0_0216072,0_0022322,0_00826184,-0_00728212,-0_00991836,-0_00647492,-0_00705358,0_000852099,0_00916899,0_00646488,-0_0136303,0_00860135,0_00855032,-0_0042847,0_00826464,-0_0125411,0_0119024,0_006077,-0_0121701,-0_00633694,0_0106387,0_002678,-0_00534479,-0_00033135,0_00870614,-0_0088966,-0_0178742,-0_0221184,-0_0150268,-0_00882293,0_0133514,2_00673e-05,0_00484133,-0_00435302,-0_00375258,-0_00474347,0_0100137,-0_00138635,-0_00340512,-0_00395603,-0_010927,0_00627443,-0_00732938,0_00522522,0_0153963,0_00680437,0_00998586,-0_00909952,-0_000745007,-0_0123557,-0_00274704,0_0144007,-0_00205408,0_00149196,-0_0128686,-0_00818602,0_00897281,0_0120735,0_00231489,0_00149785,0_00233083,0_0140474,-0_00569749,-0_0172731,-0_00248703,0_0117161,-0_00672961,-0_00385345,0_000798918,0_00322588,0_0107187,-0_00926729,-0_00327224,-0_0150796,-0_0106333,0_00905504,0_00593262,-0_00977606,-0_00167921,0_00280954,0_000260568,-0_0138556,0_00265897,0_00704232,-0_00766452,0_00117842,0_00296196,0_00796181,0_0152107,-0_000446734,0_0116665,0_00425379,0_00291349,-0_00261723,0_0108645,0_00504552,0_0194856,-0_00185258,0_00874141,-0_00380655,0_00381177,0_00066166,0_0168174,-0_0169585,-0_0169845,-0_00997418,-0_00433287,0_0014626,0_0159264,0_00397825,-0_00354744,-0_0124351,0_00485804,0_00192044,-0_00619426,-0_0140831,-0_00950992,-0_0114612,0_0107886,-0_00238499,0_00352278,0_0274581,0_0176586,-0_00779139,0_0125202,-0_00514824,-0_000943025,0_015246,0_00433638,-0_01168,-0_00179744,-0_0123802,0_00546249,-0_00556645,0_0098226,-0_0121926,-0_0127607,-0_0121785,0_00348328,-0_00258328,0_0132682,-0_0040459,0_0100218,-0_0173186,-0_00918942,0_0100641,-0_00370768,-0_0123773,-0_0171647,0_00690071,0_0199473,-0_00120797,-0_00863743,0_00372535,-0_022287,0_00139619,-0_019354,0_00179614,0_0100786,0_00528475,0_00548622,-0_0118795,0_00460937,-0_00267605,-0_00707613,0_0173714,0_016283,-0_0120334,-0_0035727,0_00557312,-0_00590001,0_0020043,-0_0139473,-0_0135057,0_00119956,-0_00694702,0_00573957,0_011223,-0_00496224,-0_00672359,-0_0117209,0_00615871,-0_00975317,0_0141397,-0_0066107,0_0114441,0_0200033,0_00139639,-0_00838904,-0_00558116,0_0109782,0_00717393}, float[16] classifier_conv2_bias =  {-0_0064689,0_00432344,-0_00479282,-0_00528322,-0_0110372,0_0108286,0_0128327,-0_00374759,0_0173122,-0_00190515,0_0169173,-0_00466059,-0_00216287,-0_00182111,-5_69294e-05,-0_0177599}, float[120,256] classifier_fc1_weight =  {0_00729654,0_005041,-0_0144716,-0_0024693,0_0231273,0_00349816,-0_0141979,0_0191028,-0_00798946,-0_00237836,-0_0265178,0_0190909,-0_0146154,-0_0149802,0_0134335,0_00202403,0_00709744,0_00482118,-0_0111114,-0_0107118,-0_00524016,-0_00508148,0_0121246,-0_00501504,0_0192483,0_0191221,-0_00664148,-0_00600051,-0_00502228,0_00273572,0_00579875,-0_0152969,0_000963682,0_00854787,-0_0137799,-0_0171367,-0_0105767,0_00721356,-0_00720632,-0_00189597,0_00303176,-0_000155257,-0_00629962,0_00718607,0_00450808,0_00749322,-0_00690157,-0_000592619,-0_00693096,0_00129414,0_0067742,0_012491,0_000315774,0_00487144,-0_00733983,0_0125396,-0_00122043,-0_0115641,-0_000110252,-0_00802177,-0_00633795,-0_0160528,0_00400892,-0_0144723,0_00181384,0_0046876,0_00845265,0_00627042,0_00343086,0_000458355,0_0017832,0_00637564,-0_00343716,-0_00996132,-0_00595233,-0_00439072,0_00784053,-0_0140701,0_0058724,0_0174451,0_0138524,-0_00789245,-0_00701005,-0_0125306,0_00445957,0_0129271,-0_00562262,0_00749498,0_0151894,0_0153475,0_0073174,-0_0119807,-0_013929,0_00290664,-4_00981e-05,0_0157182,0_00355905,-0_00980739,0_00209522,0_00843877,-0_00525339,-0_00591173,-0_00428297,0_00472665,0_0258035,-0_0127535,-0_00761125,0_00320067,-0_0140294,-0_00202617,0_0100744,-0_00654068,0_00282234,-0_00351076,0_00566221,-0_00838653,0_0272436,-0_00833551,-0_00317092,-0_00109747,0_0106028,0_00459748,0_0157375,-0_0189272,-0_00171578,0_00164737,-0_00121695,0_00701397,0_00269314,0_00285613,0_00120816,-1_84257e-05,0_00492867,-0_00379302,-0_000735774,0_000733779,0_0193883,-0_0088176,0_010619,-0_00743264,6_00335e-05,-0_000407108,-0_00373626,-0_00263545,-0_0102308,0_000353058,0_00602026,-0_00501373,0_00484008,-0_00262071,-0_00521702,0_0108998,-0_00959128,-0_00647106,-0_00716093,-0_0151247,-0_00793914,0_00913156,0_00925539,0_00277292,0_00561226,-0_00246236,-0_00333588,0_0126675,-0_00645575,0_000115177,0_00337689,0_0119102,0_0146963,-0_00360205,-0_0115263,-0_00717639,0_000959503,-0_0109456,0_010754,-0_0122467,0_0079797,0_00170571,0_0106185,0_00583884,-0_00402944,-0_0102029,-0_0025109,0_000842833,-0_00691486,0_00155894,-1_32436e-06,-0_0151946,0_00442652,0_00406783,-0_00802465,0_00690423,-0_0107509,0_0126989,-0_0130195,0_00237477,-0_0029973,0_00806348,0_0180992,0_0050676,0_00748621,-0_0102109,-0_007928,0_00524577,0_00421923,0_0154706,-0_00828593,0_0134256,-0_00291193,-0_00681329,-0_0202644,0_00394872,-0_00354917,0_00418752,-0_0191905,0_0123804,-0_00374824,0_00866367,-0_00502498,-0_0157457,0_000780351,0_00163138,0_0027503,0_0115217,0_00323824,-0_0138645,0_000194108,-0_0123744,0_0068404,0_0148514,-0_00870932,-0_0111706,-0_00770478,0_0176985,-0_00348424,-0_0130187,-0_016096,-0_0187486,-0_00255829,0_00235535,-0_00583366,0_00587414,-0_00813652,0_00176517,-0_00689872,0_00737271,0_0112542,0_00685976,-0_00566697,-0_00561771,0_00370699,-0_0130578,0_0123134,0_00277592,-0_00321801,-0_012936,-0_0108353,0_0188588,-0_0113232,0_00546735,-0_0244241,-0_022356,0_0203766,-0_00459791,0_0088124,-0_0017861,-0_0160385,-0_00105742,-0_00112239,0_00326515,0_000287093,0_000350072,-0_00991346,-0_00838107,-0_0133685,-0_00807943,-0_0037409,-0_0022159,0_00120835,-0_00104873,0_0209815,-0_00106711,0_00481466,0_00703584,-0_000759452,0_00438986,0_00214157,-0_0108765,-0_0141629,-0_00376511,-0_00883874,0_00404049,0_0288522,-0_00253749,-0_0132023,-0_00180883,0_00938094,-0_00155003,-0_00231209,0_00326385,-0_000918458,0_00847045,0_0132664,-0_000261323,-0_000892458,-0_00331759,-0_00893542,0_00100148,-0_000449271,-0_00102717,0_0206696,0_00538686,-0_000249645,-0_00864587,-0_00742309,0_0119054,-0_0109987,-0_0038488,-0_0113,0_0130446,0_00478404,-0_0031305,0_00140522,0_00241676,-0_0195605,0_00444288,-0_000718845,0_0079087,-0_00765441,-0_00709957,0_00575809,-0_00914956,-0_00878489,-0_0165205,-0_00376861,0_00168001,0_0081668,0_0141353,0_00159983,0_00546261,-0_00555708,0_01034,0_0053603,-0_00840299,-0_00727743,-0_00457887,0_0332038,-0_0029891,-0_000735388,-0_00447632,0_00998787,-0_00410077,-0_0217405,-0_0181674,0_0177159,0_0192482,0_00116337,0_0165724,-0_00960231,0_00085966,-0_00230995,-0_0104475,0_014673,-0_00133566,0_0166698,-0_00319836,2_87447e-05,0_0026054,0_00280633,0_00175271,0_00140108,0_00114128,-0_00919366,-0_0123084,-0_00342803,-0_00447334,0_000544507,-0_00528483,0_00242889,-0_00312903,-0_00112805,-0_00463231,-0_00466689,-0_00960845,-0_00865672,-0_00767211,0_0030196,-0_00354083,-0_0147165,0_00620075,0_000448555,0_00144813,-0_00744013,0_0129206,-0_0117484,0_00678816,-0_00394688,0_00420115,0_00505216,0_0162621,-0_0159279,0_00795331,0_000908353,0_00211449,-0_0151035,0_00731406,0_00236076,0_00217952,0_00139795,-0_0120547,-0_00850006,-0_00491647,-0_000523225,0_00311103,-0_0123047,0_0033717,-0_0122663,0_000636504,-0_00403407,-0_0131213,-0_0165567,-0_0117495,-0_0113764,0_0135751,0_00341133,0_000388077,0_00898131,0_00257499,-0_00951169,0_0039033,0_0251024,0_00878145,0_0328424,-0_00866576,-0_0102375,-0_026194,-0_00501544,0_0248368,-0_00635593,-0_00983586,-0_00350251,0_00866597,-0_0106332,-0_00129796,0_00902034,-0_00374277,0_00123788,0_00988334,0_00135607,-0_00291212,-0_000198219,0_0138854,-0_00712186,-0_0155818,0_0134182,-0_00523569,-0_00495068,0_00313196,-0_0163214,-0_00920488,0_0033174,0_00407305,-0_00242734,0_00918037,0_00124796,0_000503396,0_00223084,-0_00367936,0_0054218,-0_0144097,-0_00195369,0_00413218,-0_00138775,0_00595782,-0_00674118,-0_0152631,-0_00414914,0_00243195,0_0153881,-0_00401146,0_0162949,-0_00866865,-0_000715509,-0_0134999,-0_0103899,0_00837298,0_00337127,0_00210353,0_0219412,-0_00604129,0_0126211,-0_0126308,-0_00355351,-0_0134216,-0_00532327,0_00065332,-0_000631274,-0_00288084,0_00646468,-0_00147418,0_00348419,-0_0171301,0_0187234,-0_00368426,-0_0205203,-0_00998385,0_00531063,-0_00069155,0_00466825,-0_00633505,0_0164368,0_000965863,0_0118898,0_00577868,0_0078034,0_0119747,-0_00136805,0_00720076,-0_00545659,-0_013226,-0_00141635,0_0141547,-0_0126493,0_00856144,0_0123502,-0_00388161,-0_00126954,-0_0153404,-0_00142813,-0_0095047,-0_02806,0_0203057,-0_010292,-0_0256627,-0_00787083,0_0121638,-0_0161962,0_00561556,-0_00311399,0_00614655,-0_00282805,-0_000162551,-0_00469162,-0_0106468,-0_00790527,0_00173417,-0_0136926,0_011109,-0_00278028,0_000879084,-0_00956207,-0_00141414,0_00781791,-0_00780205,-0_00386018,-0_00315248,0_000888251,0_0146049,0_00555721,0_00101875,0_0050366,0_0114411,-0_000456259,0_00479498,-0_0296226,0_00808292,0_00827361,-0_0101828,0_00397465,-0_0114464,0_0071103,0_00495998,-0_00542035,0_00175864,0_00695297,-0_00158953,0_00530823,0_00146731,0_00309425,0_00709447,0_0118855,-0_0117528,-0_00478046,-0_0197156,0_00593144,0_0104011,-0_00652219,-0_00939738,0_00484077,-0_000403005,-0_00164123,-0_00764357,0_00478133,0_00430809,-0_0132164,-0_00697957,-0_00872982,-0_00574944,0_00642543,-0_00369017,-0_0034926,-0_0170304,0_0179831,-0_00596401,0_00280171,0_0117196,0_000487063,-0_0068524,0_0112269,-0_00515043,-0_00502776,0_00470218,0_00784933,-0_0102283,-0_0026237,-0_00329235,-0_0158781,0_00850027,0_0113603,-0_00128119,-0_00173278,0_00727873,-0_00930748,-0_00431162,0_00360689,0_011302,-0_0137121,0_0298028,-0_00558045,-0_000539685,-0_0124873,0_0130724,-0_00228471,0_00520324,-0_0111967,0_0113196,0_00554047,0_00676272,-0_00428586,0_0117752,0_0109919,0_00881377,-0_0133897,0_00633583,-0_00824263,-0_0127549,-0_0159164,-0_012847,0_00282207,0_01567,-0_0127353,-0_0201613,0_00123036,-0_000744107,0_00123974,0_00334272,0_00248482,0_00144749,0_0019969,0_0126944,0_00579181,-0_00482563,-0_00794987,0_00610318,-0_0048817,-0_00652065,-0_00362276,-0_00414224,-0_00567657,-0_00663434,0_0149976,-0_015686,-0_0050063,-0_00610286,-0_00349662,-0_00530115,0_0046101,0_00602661,-0_0161022,-0_00639025,-0_00239231,-0_00703957,0_0046374,0_00412166,0_0073638,0_00791654,0_00622817,0_00561266,0_0170308,0_00931591,0_00883302,0_00801914,0_0142466,0_00858522,0_00534769,-0_00255118,0_00372807,-0_0102065,-0_0102047,0_00661993,0_00676733,-0_00836988,-0_00332568,-0_000371074,-0_0010259,0_00145308,0_00422475,-0_0082034,-0_00949501,-0_0169104,-0_0107763,-0_00449904,0_00223036,-0_00380758,-0_000316024,-0_00747457,0_0186728,-0_0142918,0_000882179,-0_000626433,0_00273092,-0_0141194,0_00569793,-0_0053549,-0_0149581,-0_00292681,-0_000912517,-0_00188248,-0_00482606,-0_0162032,0_00130506,0_0186663,-0_000312748,-0_00128169,0_00724467,0_000608441,0_00617523,-0_0162337,-0_00695046,-0_0144602,-0_00465546,-0_0117017,-0_0101089,-0_00719363,-0_00734193,-0_000515494,-0_00557351,0_0158728,0_0126571,0_00166022,0_00145865,0_0113382,0_000391552,0_00256128,-0_00192204,-0_00167355,-0_00969139,-0_000143666,-0_00698075,-0_0146093,0_00446157,0_00516622,0_00904222,0_0125402,-0_00830888,0_00070622,0_00446391,-0_00867294,0_00899761,-0_0190995,-0_010814,0_00999459,0_0113518,0_0168525,-0_00804391,0_0177648,0_00615906,0_0028061,-0_00429123,0_0149365,-0_00235165,-0_0105058,0_0180388,-0_00209931,0_00851708,2_04693e-05,-0_00822052,4_99491e-05,0_00307168,-0_00752879,0_0147874,-0_0153842,0_0120674,-0_0140464,-0_004436,0_00447463,-0_00146473,-0_0200537,0_00160891,0_00892729,0_00110655,-0_0128116,0_00163264,0_00813249,0_00165412,-0_00266039,-0_0030922,0_00473066,0_00817722,0_00027391,0_00419161,-0_00847165,0_00455515,-0_00485413,0_0041199,-0_00705758,0_00846865,-0_0179982,0_00806189,-0_00856647,-0_00439463,0_0160452,0_0042855,0_000735574,-0_00987748,-0_0154351,-0_0268659,0_000587701,-0_0105513,-0_00520662,-0_00253099,0_0132656,-0_0111555,-0_00302511,0_00257269,-0_00778193,-0_00977102,-0_0134314,-0_0138978,0_00350542,-0_00467191,0_0151984,-0_00363573,-0_000504147,-0_0129741,0_010542,0_019028,0_0228621,0_00323153,0_00474386,0_00543727,-0_00903408,0_000275345,0_00844811,-0_0122059,0_00492166,-0_000558768,0_000506667,0_00245334,-0_0140825,-0_0257407,-0_0223239,0_00928248,-0_0135627,0_0107149,-0_00252714,-0_013006,-0_00611432,0_00388981,0_0105749,-0_0010505,0_00611709,0_0145285,0_0104483,-0_00792369,-0_010687,0_00120351,-0_0163876,0_0138798,-0_00722368,-0_000842398,-0_0107587,-0_014211,-0_00140125,0_0163154,-0_00623591,0_0150424,-0_00127259,0_00929186,0_00622663,-0_00177759,-0_0130269,0_0137172,-0_00269095,-0_00547403,0_0142324,0_00917043,0_014814,-0_0108728,-0_00688452,0_012381,0_00801717,-0_0016759,0_0182252,-0_0171588,-0_0254549,-0_0198938,0_00692225,-0_010012,-0_0168037,-0_00594807,0_00135844,-0_00131797,0_00862836,0_0124266,0_00335072,0_00620984,-0_00628246,0_00660778,-0_00857698,0_00796895,-0_00154219,0_00848353,-0_00351492,0_00520407,0_0134406,0_0052481,0_00288577,-0_00180662,0_00530791,0_0101309,-0_0124417,0_0128453,0_00311977,0_0228436,0_00181226,-0_00300543,-0_00287385,-0_0115048,-0_00324676,0_0147658,0_00372032,-0_00162517,0_00953515,0_0136697,0_00904788,-0_00317449,-0_00645433,0_000274103,-0_0013448,-0_00759118,-0_00429667,-0_00865413,0_00762824,0_013843,-0_00439886,-0_00597592,0_00776304,0_00931536,0_00559414,0_00262519,0_0075072,-0_000173094,0_0174543,0_00555289,-0_00580077,-0_00782661,0_00204487,-0_0148286,0_00845497,2_8827e-05,0_00673425,-0_0084009,0_023495,0_00342432,-0_00407799,-0_00323505,0_0159275,-0_00628847,-0_00614073,0_0111069,-0_00473457,-0_015649,0_000676846,0_0078607,0_00764921,-0_00201988,0_00451808,0_00455928,0_000291932,-0_00843469,0_0128553,-0_000161153,0_0295892,-0_0042716,-0_0129651,0_0131152,0_00624834,0_00566988,0_000950808,-0_00279384,0_000712097,0_0183994,0_00606842,0_00294466,-0_0164611,-0_00509373,0_00148011,0_00451864,-0_0026977,-0_0080766,0_0141226,-0_00786133,0_0174384,-0_00713254,0_0106245,0_00137281,-0_0127705,-0_0088589,-0_00790215,-0_0080091,0_0055756,-0_00787447,0_0123682,-0_020424,-0_00439361,0_00883919,-0_0114885,-0_00528496,-0_0151721,0_00703711,-0_0037568,-0_0207353,0_0151815,0_016155,0_0254094,-0_011036,-0_00829907,0_0123757,0_00593476,0_00214484,0_0115888,0_00222925,0_00464066,0_00241832,-0_0111714,0_000275608,0_0107055,-0_00479462,0_00553695,-0_0158208,0_00390313,0_00732508,-0_0207763,0_00767535,-0_00582439,0_010597,0_0065379,-0_0111537,0_0164437,0_00335114,-0_00793639,-0_00534499,0_0129248,0_0172886,0_0048092,-0_00762918,-0_010258,0_00731624,0_0223279,-0_01608,-0_00402946,-0_00717906,0_00513613,0_00948499,-0_000522164,-0_0055746,0_00919222,-0_00328915,0_00964764,0_00894292,0_0125134,-0_00492297,0_0177709,0_00736549,-0_00359183,0_00164492,-0_00436982,-0_00124936,-0_0175361,0_000652562,-0_00738986,-0_0111529,-0_0112196,-0_006756,-0_00620961,-0_0022522,-0_0113894,0_0104405,-0_00593165,0_0152513,0_0165655,0_00908104,-0_00548968,0_00440849,0_00165361,-0_00881705,-0_00856196,-0_00169236,0_000825735,0_0152734,-0_0127961,0_00429291,-0_0129176,0_00134782,-0_00549094,-0_0141425,0_0108665,-0_00247495,0_0106664,-0_0118717,-0_00547037,0_0154351,-0_011536,-0_00244893,0_00363375,0_0149542,0_00532435,0_0181427,0_00184109,-0_00415709,0_0070765,0_00414594,-0_00760032,0_00238599,0_0143903,0_00142653,-0_00380602,-0_0139752,0_0142627,-0_00779304,0_00188998,0_016933,0_00724179,-0_0109592,0_01041,0_0132179,-0_0133235,0_00717418,0_0111817,0_00114859,0_00469503,0_0111217,-0_00195728,0_00374573,-0_00205001,-0_0101649,-0_00477979,-0_0044106,-0_0139366,-0_0145569,-0_0132351,0_0170492,-0_0117821,0_00542058,-0_0179128,-0_0120519,0_00535223,0_00771743,0_00827389,0_00265265,-0_0152169,-0_0108218,0_00123568,-0_00725496,-0_00489787,-0_0041679,-0_00325007,-0_0132745,0_00746415,-0_00609768,0_00225028,-0_00603197,0_00600996,0_00242095,-0_00431619,0_00557592,0_0152284,-0_00060934,-0_0040852,-0_00079611,-0_00350448,-0_0214766,-0_00589749,0_0043696,0_00294678,0_00248682,-0_000378857,-0_00339834,-0_00339985,0_00185833,0_00775562,0_00872137,0_018847,-0_0201623,0_0154189,0_0177048,-0_00205003,-0_0091059,-0_0107987,-0_010344,-0_0213503,-0_0139536,-0_00981041,0_000243863,-0_00235389,0_00143511,0_00125969,0_0241079,0_0086407,-0_00929108,-0_00711427,-0_00678193,-0_0012563,0_00918247,-0_00246048,-0_0191695,-0_0188238,0_00307357,0_0123874,-0_00274401,-0_00175893,0_015855,0_00970291,0_00955842,0_00897732,0_00771438,-0_00958661,0_000876049,-0_0077687,0_00291329,-0_00095184,-0_00353689,0_00477835,-0_000812137,0_00637371,0_0298962,0_00986108,-0_00311948,-0_0022669,-0_00755461,0_00373055,0_00202909,0_0123426,0_00873992,-0_00807343,0_00903313,0_00702966,-0_00492784,-0_0136023,0_000701588,0_0132121,-0_00163383,0_00935755,0_0163985,-0_0208284,-0_00422449,-0_0124936,-0_00599454,0_0019709,-0_00244898,0_00739971,0_00106488,0_0125605,0_0003041,-0_000847922,0_00471822,-0_00668978,-0_0121552,-0_0109072,-0_0007476,0_010042,0_0157489,-0_0052753,-0_00890632,0_0101575,-0_00344199,0_00333608,-0_000852694,-0_0085396,-0_00242216,0_00145268,0_0187954,-0_0173224,0_0059189,-0_0036451,0_00538105,0_00519918,0_000746276,0_00730483,0_00662327,-0_00312742,-0_0102073,0_0133472,-0_0144353,0_012707,0_00634673,0_00953166,-0_00364089,-0_00685253,0_00022628,0_0213276,0_0117561,0_0133347,0_00183821,-0_00606462,-0_019464,-0_00113355,-0_00921845,-0_0122073,-0_00336532,-0_0133575,-0_00953968,2_36664e-06,0_00237244,0_00806803,-0_00312939,0_00591442,0_000174437,-0_0068974,0_0023792,0_0156886,0_00171066,0_0229498,-0_00652697,0_00621768,-0_00883792,-0_00660086,-0_0137681,-0_000812144,-0_00101551,0_00551315,-0_0114073,-0_00211278,0_0163758,-0_0135289,0_0128025,-0_00521143,0_00756716,0_00812763,-0_00711085,-0_0142281,0_0237873,-0_0136451,0_0163042,-0_0115436,0_0113968,-0_00997258,-0_00659848,-0_0153541,0_000406747,-0_00740035,-0_0159889,-0_016669,-0_0203282,-0_00544336,0_0191851,-0_00402774,-0_000603664,-0_0139768,-0_000539604,0_00981689,-0_00277877,-0_0176892,0_00321267,0_000562134,0_00188834,-0_013806,0_00831178,-0_0243558,0_0182715,0_0016625,0_000718529,-0_0111761,-0_00683196,0_0144618,-0_00349044,-0_0082622,0_00373425,-0_00414682,0_0165809,-0_0145904,0_000727144,0_00251159,-0_00501394,-0_00523052,0_00855291,0_0110426,-0_0175802,-0_0122782,-0_00896972,-0_00242617,-0_0141725,-0_0128769,0_00098954,0_0111217,-0_00767512,-0_000638791,0_0137164,0_00628228,0_00308895,-0_0120542,-0_00292327,0_00023315,0_0187029,0_011836,-0_0151475,-0_00521242,-0_00252463,-0_00535998,0_00123927,-0_00198428,0_00381924,0_0138369,0_0096576,-0_00327971,-0_0163078,0_00144519,-0_0181255,-0_011008,-0_00707749,0_00397224,-0_00212506,0_00279745,0_00577046,-0_0118944,0_00282053,-0_0150462,0_0060106,0_00111644,-0_0128551,-0_000742928,0_00292567,0_00679544,0_0130009,-0_0136649,-0_00555595,-0_00394726,-0_000316041,-0_01208,-0_00783947,0_00347244,-0_00877218,-0_0064843,-0_0101466,-0_0157993,-0_0136455,0_0234209,0_00342575,0_00583824,0_0107405,-0_0139738,0_00615544,0_0162266,0_00220946,-0_00340412,-0_00514207,-0_00252971,-0_00220025,-0_00366605,-0_00706624,-0_000377068,0_00618146,0_031676,0_00235282,0_0160501,-0_00863407,-0_0127462,0_0119619,0_00224073,-0_00664508,-0_0045753,0_00497509,0_00287154,0_000961063,0_0115034,0_0068859,0_0173475,-0_00422652,0_0177466,0_0075151,-0_0133352,0_0101732,-0_00426408,-0_0153258,-0_00964382,0_0119163,0_00385386,0_00896721,0_0106499,-0_0134168,0_015397,-0_0021572,0_000473235,-0_00830032,0_0103952,-0_0115876,-0_0152517,-0_00490886,0_00951327,0_0191493,-0_00964454,-0_00162241,0_00320801,-0_00630082,0_00383849,-0_00480659,-0_00732752,-0_00910358,0_0125938,0_00516708,0_00323734,0_0169801,-0_00452038,-0_00677273,-0_0101549,-0_0151678,0_0053121,0_00215251,0_00214586,-0_0174108,-0_00671498,-0_00140298,0_00739186,-0_000499782,0_00435034,-0_00561964,0_00859497,-0_00401195,-0_000664858,-0_0109713,-0_00332561,0_00894748,0_00399938,-0_00576821,0_0112577,-0_00828459,0_0016885,0_00541562,0_00824947,-0_00218882,0_00272332,-0_0126452,-0_0105464,-0_00127531,0_00640923,0_011478,0_0034131,-0_000307861,0_000374584,-0_00043562,-0_010713,0_00740723,0_0222384,0_000975852,-0_00170619,0_00407948,-0_00126846,0_0112623,-0_0118941,0_0017494,0_00474266,-0_0071226,0_00922189,0_018385,0_00395045,-0_00354253,0_00328728,-0_000601206,0_00262344,-0_00223737,-0_0156726,-0_0008823,-0_0191655,0_0026366,-0_0115285,0_0136935,0_00819586,-0_0113068,0_0100596,0_00969873,0_00100537,-0_0048481,0_0085344,0_00169319,0_00146079,0_0146942,0_00455402,-0_0101708,0_00650093,-0_00888242,0_0142221,-0_0133823,0_0040815,0_00613982,-0_00960541,-0_00268402,0_00448834,0_0137915,0_0166228,0_000509757,-0_00257239,-0_00432536,-0_00725082,0_0156465,-0_00796133,0_00261352,-0_00902572,-0_00796948,-0_00203402,0_00401597,0_0194307,0_0159842,-0_00108341,-0_0052655,0_00870347,-0_0101795,-0_00916931,0_0233451,0_000553333,-0_0108306,0_0152911,-0_00556351,0_0107307,-0_0118598,0_00811956,0_00153003,-0_0169913,0_0115047,0_0118945,0_0109746,-0_00912305,-0_0133939,0_0103135,-0_00285572,-0_000921836,0_00786064,-0_00176817,0_00904872,0_00178491,0_00549091,0_0156841,0_00518603,0_0105218,-0_00176112,0_00975883,0_0111546,0_00221271,0_00879491,0_0147011,-0_0194304,0_002825,-0_00182515,0_00832384,-0_0165178,-0_0108891,-0_00325319,-0_0156204,0_00980166,0_00398542,0_0167028,-8_43481e-05,-0_00891038,0_0195983,0_0138952,0_00615375,-0_00381772,0_00262496,0_0134548,0_0050546,0_00281609,-0_00884917,-0_00493475,0_0175632,0_00691026,-0_00409224,-0_00414799,-0_00494439,-0_0129016,0_00672378,0_00751112,0_0100274,0_0090058,0_00714076,-0_0124261,-0_00371846,-0_00841878,0_0093815,0_0134708,-0_00154461,-0_000134926,0_00273795,-0_0094397,0_00438146,-0_00599208,-0_00409743,-0_0049345,0_00427789,0_0181853,0_00204998,-0_00447755,-0_00185113,0_00497416,0_010999,-0_00698157,-0_000157194,-0_0170401,-0_00220694,-0_00522389,-0_0198101,0_0118708,0_00717235,0_0101563,-0_00514513,-0_00345386,0_00441719,0_000244741,-0_0209241,-0_00341318,-0_0232563,0_000689287,-0_00747923,-0_000917281,-0_00147205,0_00221133,0_00248386,0_00699653,-0_00381487,0_00943349,-0_0150957,0_00039779,0_0161315,-0_00108958,-0_00799888,-0_0152408,0_020379,0_00439111,0_00385911,-0_000906159,0_00509934,0_0044724,-0_00345423,-0_00789984,0_00581174,0_000608953,-0_00260851,0_00878862,-0_00217519,0_00136462,-0_0189475,0_00757943,0_0056647,-0_00534228,-0_0105525,-0_000744121,0_000583848,0_00366485,-0_00131321,0_00540344,0_00811209,-0_00216402,-0_00587086,-0_00268808,0_000499726,0_0133909,0_0215827,0_0141569,-0_00351692,0_00570073,-0_00479053,0_0148309,-0_0106238,-0_00214202,-0_0123021,0_00576355,0_00656691,-0_00296927,0_00289614,-0_00744656,0_000173226,0_00928599,0_0109064,0_00322123,-0_000995773,-0_00648014,0_0172043,-0_0063071,-0_0220966,0_00407203,0_00761477,0_000768391,-0_0116085,-0_00122265,-0_0153812,-0_00727744,0_00289303,0_00699614,-0_00324842,0_00150214,0_000806709,0_00738382,-0_00559203,-0_0132064,-0_01441,-0_00553372,0_00705253,-0_000817916,0_0126679,0_00245081,0_0139277,0_00534509,0_00264673,-0_00353033,0_0159687,0_00250443,-0_00881463,0_000546941,-0_00753455,0_00378254,-0_0108179,0_00102803,-0_0075442,0_0156628,0_00153255,-0_0027652,0_000346647,0_00327397,-0_000797366,-0_00429894,0_0171418,0_0074965,-0_0128129,