<
   ir_version: 9,
   opset_import: ["" : 14],
   producer_name: "pytorch",
   producer_version: "2.0.1"
>
torch_jit (float[8,3,16,16] input_1, float[1000,512] model_fc_weight, float[1000] model_fc_bias, float[64,3,7,7] onnx__Conv_326, float[64] onnx__Conv_327, float[64,64,3,3] onnx__Conv_329, float[64] onnx__Conv_330, float[64,64,3,3] onnx__Conv_332, float[64] onnx__Conv_333, float[128,64,3,3] onnx__Conv_335, float[128] onnx__Conv_336, float[128,128,3,3] onnx__Conv_338, float[128] onnx__Conv_339, float[128,64,1,1] onnx__Conv_341, float[128] onnx__Conv_342, float[128,128,3,3] onnx__Conv_344, float[128] onnx__Conv_345, float[128,128,3,3] onnx__Conv_347, float[128] onnx__Conv_348, float[128,128,3,3] onnx__Conv_350, float[128] onnx__Conv_351, float[128,128,3,3] onnx__Conv_353, float[128] onnx__Conv_354, float[128,128,3,3] onnx__Conv_356, float[128] onnx__Conv_357, float[128,128,3,3] onnx__Conv_359, float[128] onnx__Conv_360, float[256,128,3,3] onnx__Conv_362, float[256] onnx__Conv_363, float[256,256,3,3] onnx__Conv_365, float[256] onnx__Conv_366, float[256,128,1,1] onnx__Conv_368, float[256] onnx__Conv_369, float[256,256,3,3] onnx__Conv_371, float[256] onnx__Conv_372, float[256,256,3,3] onnx__Conv_374, float[256] onnx__Conv_375, float[256,256,3,3] onnx__Conv_377, float[256] onnx__Conv_378, float[256,256,3,3] onnx__Conv_380, float[256] onnx__Conv_381, float[256,256,3,3] onnx__Conv_383, float[256] onnx__Conv_384, float[256,256,3,3] onnx__Conv_386, float[256] onnx__Conv_387, float[512,256,3,3] onnx__Conv_389, float[512] onnx__Conv_390, float[512,512,3,3] onnx__Conv_392, float[512] onnx__Conv_393, float[512,256,1,1] onnx__Conv_395, float[512] onnx__Conv_396, float[512,512,3,3] onnx__Conv_398, float[512] onnx__Conv_399, float[512,512,3,3] onnx__Conv_401, float[512] onnx__Conv_402, float[512,512,3,3] onnx__Conv_404, float[512] onnx__Conv_405, float[512,512,3,3] onnx__Conv_407, float[512] onnx__Conv_408, float[512,512,3,3] onnx__Conv_410, float[512] onnx__Conv_411, float[512,512,3,3] onnx__Conv_413, float[512] onnx__Conv_414, float[512,512,3,3] onnx__Conv_416, float[512] onnx__Conv_417, float[512,512,3,3] onnx__Conv_419, float[512] onnx__Conv_420, float[512,512,3,3] onnx__Conv_422, float[512] onnx__Conv_423, float[512,512,3,3] onnx__Conv_425, float[512] onnx__Conv_426) => (float[8,1000] output_var) {
   conv_output_0000 = Conv <dilations = [1, 1], group = 1, kernel_shape = [7, 7], pads = [3, 3, 3, 3], strides = [2, 2]> (input_1, onnx__Conv_326, onnx__Conv_327)
   relu_output_0000 = Relu (conv_output_0000)
   maxpool_output_0000 = MaxPool <ceil_mode = 0, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [2, 2]> (relu_output_0000)
   conv_output_0001 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (maxpool_output_0000, onnx__Conv_329, onnx__Conv_330)
   relu_output_0001 = Relu (conv_output_0001)
   conv_output_0002 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0001, onnx__Conv_332, onnx__Conv_333)
   add_output_0000 = Add (conv_output_0002, maxpool_output_0000)
   relu_output_0002 = Relu (add_output_0000)
   conv_output_0003 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [2, 2]> (relu_output_0002, onnx__Conv_335, onnx__Conv_336)
   relu_output_0003 = Relu (conv_output_0003)
   conv_output_0004 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0003, onnx__Conv_338, onnx__Conv_339)
   conv_output_0005 = Conv <dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [2, 2]> (relu_output_0002, onnx__Conv_341, onnx__Conv_342)
   add_output_0001 = Add (conv_output_0004, conv_output_0005)
   relu_output_0004 = Relu (add_output_0001)
   conv_output_0006 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0004, onnx__Conv_344, onnx__Conv_345)
   relu_output_0005 = Relu (conv_output_0006)
   conv_output_0007 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0005, onnx__Conv_347, onnx__Conv_348)
   add_output_0002 = Add (conv_output_0007, relu_output_0004)
   relu_output_0006 = Relu (add_output_0002)
   conv_output_0008 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0006, onnx__Conv_350, onnx__Conv_351)
   relu_output_0007 = Relu (conv_output_0008)
   conv_output_0009 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0007, onnx__Conv_353, onnx__Conv_354)
   add_output_0003 = Add (conv_output_0009, relu_output_0006)
   relu_output_0008 = Relu (add_output_0003)
   conv_output_0010 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0008, onnx__Conv_356, onnx__Conv_357)
   relu_output_0009 = Relu (conv_output_0010)
   conv_output_0011 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0009, onnx__Conv_359, onnx__Conv_360)
   add_output_0004 = Add (conv_output_0011, relu_output_0008)
   relu_output_0010 = Relu (add_output_0004)
   conv_output_0012 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [2, 2]> (relu_output_0010, onnx__Conv_362, onnx__Conv_363)
   relu_output_0011 = Relu (conv_output_0012)
   conv_output_0013 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0011, onnx__Conv_365, onnx__Conv_366)
   conv_output_0014 = Conv <dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [2, 2]> (relu_output_0010, onnx__Conv_368, onnx__Conv_369)
   add_output_0005 = Add (conv_output_0013, conv_output_0014)
   relu_output_0012 = Relu (add_output_0005)
   conv_output_0015 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0012, onnx__Conv_371, onnx__Conv_372)
   relu_output_0013 = Relu (conv_output_0015)
   conv_output_0016 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0013, onnx__Conv_374, onnx__Conv_375)
   add_output_0006 = Add (conv_output_0016, relu_output_0012)
   relu_output_0014 = Relu (add_output_0006)
   conv_output_0017 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0014, onnx__Conv_377, onnx__Conv_378)
   relu_output_0015 = Relu (conv_output_0017)
   conv_output_0018 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0015, onnx__Conv_380, onnx__Conv_381)
   add_output_0007 = Add (conv_output_0018, relu_output_0014)
   relu_output_0016 = Relu (add_output_0007)
   conv_output_0019 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0016, onnx__Conv_383, onnx__Conv_384)
   relu_output_0017 = Relu (conv_output_0019)
   conv_output_0020 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0017, onnx__Conv_386, onnx__Conv_387)
   add_output_0008 = Add (conv_output_0020, relu_output_0016)
   relu_output_0018 = Relu (add_output_0008)
   conv_output_0021 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [2, 2]> (relu_output_0018, onnx__Conv_389, onnx__Conv_390)
   relu_output_0019 = Relu (conv_output_0021)
   conv_output_0022 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0019, onnx__Conv_392, onnx__Conv_393)
   conv_output_0023 = Conv <dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [2, 2]> (relu_output_0018, onnx__Conv_395, onnx__Conv_396)
   add_output_0009 = Add (conv_output_0022, conv_output_0023)
   relu_output_0020 = Relu (add_output_0009)
   conv_output_0024 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0020, onnx__Conv_398, onnx__Conv_399)
   relu_output_0021 = Relu (conv_output_0024)
   conv_output_0025 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0021, onnx__Conv_401, onnx__Conv_402)
   add_output_0010 = Add (conv_output_0025, relu_output_0020)
   relu_output_0022 = Relu (add_output_0010)
   conv_output_0026 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0022, onnx__Conv_404, onnx__Conv_405)
   relu_output_0023 = Relu (conv_output_0026)
   conv_output_0027 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0023, onnx__Conv_407, onnx__Conv_408)
   add_output_0011 = Add (conv_output_0027, relu_output_0022)
   relu_output_0024 = Relu (add_output_0011)
   conv_output_0028 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0024, onnx__Conv_410, onnx__Conv_411)
   relu_output_0025 = Relu (conv_output_0028)
   conv_output_0029 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0025, onnx__Conv_413, onnx__Conv_414)
   add_output_0012 = Add (conv_output_0029, relu_output_0024)
   relu_output_0026 = Relu (add_output_0012)
   conv_output_0030 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0026, onnx__Conv_416, onnx__Conv_417)
   relu_output_0027 = Relu (conv_output_0030)
   conv_output_0031 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0027, onnx__Conv_419, onnx__Conv_420)
   add_output_0013 = Add (conv_output_0031, relu_output_0026)
   relu_output_0028 = Relu (add_output_0013)
   conv_output_0032 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0028, onnx__Conv_422, onnx__Conv_423)
   relu_output_0029 = Relu (conv_output_0032)
   conv_output_0033 = Conv <dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]> (relu_output_0029, onnx__Conv_425, onnx__Conv_426)
   add_output_0014 = Add (conv_output_0033, relu_output_0028)
   relu_output_0030 = Relu (add_output_0014)
   globalaveragepool_output_0000 = GlobalAveragePool (relu_output_0030)
   flatten_output_0000 = Flatten <axis = 1> (globalaveragepool_output_0000)
   output_var = Gemm <alpha = 1, beta = 1, transB = 1> (flatten_output_0000, model_fc_weight, model_fc_bias)
}